# Example

#### Import Pandas

In [2]:
import pandas as pd

#### Example Data

In [2]:
data = {
    "foo": list(range(1, 9)),
    "bar": ['a', 'b', 'c', 'd', 'b', 'a', None, None],
    "baz": ['mi', 'mo', 'mu', 'mi', 'mo', 'ma', 'ma', None]
}

In [3]:
data

{'foo': [1, 2, 3, 4, 5, 6, 7, 8],
 'bar': ['a', 'b', 'c', 'd', 'b', 'a', None, None],
 'baz': ['mi', 'mo', 'mu', 'mi', 'mo', 'ma', 'ma', None]}

#### Example data from CSV file

In [4]:
csv = pd.read_csv('/data/demo-data.csv')
csv

   nr.   fruit  amount customer
0    0   apple       3     Anna
1    1  banana       5      Fin
2    2  orange       3     Anna
3    3  orange       4      Mia
4    4   apple       2      Fin

#### Create a DataFrame from our example data

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

   foo   bar   baz
0    1     a    mi
1    2     b    mo
2    3     c    mu
3    4     d    mi
4    5     b    mo
5    6     a    ma
6    7  None    ma
7    8  None  None

#### Show some information about the DataFrame

In [7]:
dataFrame.dtypes

foo     int64
bar    object
baz    object
dtype: object

In [8]:
dataFrame.shape

(8, 3)

In [9]:
dataFrame.count()

foo    8
bar    6
baz    7
dtype: int64

#### Clean up incomplete rows

In [10]:
cleanDataFrame = dataFrame.dropna()
cleanDataFrame

   foo bar baz
0    1   a  mi
1    2   b  mo
2    3   c  mu
3    4   d  mi
4    5   b  mo
5    6   a  ma

#### Clean up incomplete columns

In [11]:
dataFrame.dropna(axis=1, how='any')

   foo
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8

#### Set an index

In [12]:
cleanDataFrame.set_index('bar', inplace=True)
cleanDataFrame

     foo baz
bar
a      1  mi
b      2  mo
c      3  mu
d      4  mi
b      5  mo
a      6  ma

#### Select rows

In [13]:
cleanDataFrame.loc['c']

foo     3
baz    mu
Name: c, dtype: object

In [14]:
cleanDataFrame.loc['a']

     foo baz
bar
a      1  mi
a      6  ma

### Combining DataFrames

In [3]:
df1 = pd.DataFrame({'foo':[1, 2], 'bar': [3, 4]})
df2 = pd.DataFrame({'foo':[5,6], 'bar': [7, 8]})
print(df1)
print(df2)

   foo  bar
0    1    3
1    2    4
   foo  bar
0    5    7
1    6    8

In [4]:
print(df1.append(df2))
print(df1.append(df2, True))

   foo  bar
0    1    3
1    2    4
0    5    7
1    6    8
   foo  bar
0    1    3
1    2    4
2    5    7
3    6    8